
## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251208100154" -> "packer-debian-13.2.0-20251209212133" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.50" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/200" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-master-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.50" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;master" -> "k3s,master"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:2b:70:b8" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:33:49:3b" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "3eb14772-cffd-4826-97a0-a1cc2e177346" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251208100154" -> "packer-debian-13.2.0-20251209212133" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.51" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/201" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-worker-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.51" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:c4:0c:51" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:cb:6c:97" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "7ea31679-62c7-430f-939a-1190a53df6a8" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (1 unchanged block hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.2.0-20251208100154" -> "packer-debian-13.2.0-20251209212133" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.52" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/202" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-worker-02"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.52" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:94:48:86" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:e8:24:81" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "6f497942-9a1b-4e10-8284-e2c83300f43c" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*